In [1]:
import pandas as pd
import numpy as np

In [6]:
obj1 = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])

In [3]:
obj2 = pd.Series([10, -2, 30, 13], index=['f', 'b', 'e', 'd'])

In [5]:
obj1 + obj2

a         NaN
b   -1.000000
c         NaN
d    0.307692
e         NaN
f         NaN
dtype: float64

In [8]:
# Dataframe
df = pd.DataFrame({"College": ["CEDAT", "CoNAS", "CAES", "CHS", "CoBAMS"],
"Budget": [123, 456, 678, 345, 345],
"Popn": [450, 900, 1000, 2000, 4350]})

In [9]:
df

  College  Budget  Popn
0   CEDAT     123   450
1   CoNAS     456   900
2    CAES     678  1000
3     CHS     345  2000
4  CoBAMS     345  4350

In [11]:
df.head(3)

  College  Budget  Popn
0   CEDAT     123   450
1   CoNAS     456   900
2    CAES     678  1000

In [12]:
df.tail(2)

  College  Budget  Popn
3     CHS     345  2000
4  CoBAMS     345  4350

In [14]:
df.columns

Index(['College', 'Budget', 'Popn'], dtype='object')

In [18]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [20]:
df.iat[0, 2]

450

In [26]:
df2 = pd.DataFrame(
    columns=["College", "Budget", "Popn"],
    data=[
        ["COCIS", 456, 1234],
        ["CHS", 123, 678],
        ["CEDAT", 679, 987]
    ])

In [27]:
df2

  College  Budget  Popn
0   COCIS     456  1234
1     CHS     123   678
2   CEDAT     679   987

In [31]:
df2["College"]

0    COCIS
1      CHS
2    CEDAT
Name: College, dtype: object